src/Catalogs/Объекты/Объекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="ac03d05d-31ff-4be8-8134-befc15ed8a20">
  <name>Объекты</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="f6c31941-e0ce-4411-9dc8-1dca828a5160">
    <name>Тип</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>кфкИмяEN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="35277a40-8eae-4ba3-886e-04e15c93bfdc">
    <name>Имя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Объекты/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура кфкПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	Элементы.ГруппаИдентификацияОбъекта.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	
	Группа = Элементы.Добавить("кфкИменаОбъекта", Тип("ГруппаФормы"), Элементы.ГруппаИдентификацияОбъекта);
	Группа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	Группа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	Группа.ОтображатьЗаголовок = Ложь;
	
	Элементы.Переместить(Элементы.Имя, Группа);
	
	Элемент = Элементы.Добавить("кфкИмяEN", Тип("ПолеФормы"), Группа);
	Элемент.ПутьКДанным = "Объект.кфкИмяEN";
	Элемент.Вид = ВидПоляФормы.ПолеВвода;
	
КонецПроцедуры

#КонецОбласти
